#include <iostream>
using namespace std;
int main() {
	setlocale(LC_ALL, "RUS");
	//8. ƒаны натуральные числа от 20 до 50.Ќапечатать те из них, которые дел€тс€ на 3, но не дел€тс€ на 5.
	//int a;
	//cin >> a;
	/*for (int i = 20; i <= 50; i = a + 1) {
		if (i % 3 == 0 && i % 5 != 0) {
			cout << i << endl;
		}
	}*/
	//9. даны натуральные числа от 35 до 87. Ќайти и напечатать те из них, которые при делении на 7 дают остаток 1, 2 или 5.
	/*int a;
	cin >> a;
	for (int i = 35; i <= 87; i = a + 1) {
		if (i % 7 == 1 || i % 7 == 0|| i % 7 == 5) {
			cout << i << endl;
		}
	}*/
	//10. ƒаны натуральные числа от 1 до 50. Ќайти сумму тех из них, которые дел€тс€ на 5 или на 7.
	/*int a;
	cin >> a;
	for (int i = 1; i <= 50; i = a + 1) {
		if (i % 5 == 1 || i % 7 == 0 ) {
			a = a + 1;
			cout << i << endl;
		}
	}*/
	//11. Ќапечатать те из двузначных чисел которые дел€тс€ на 4, но не дел€тс€ на 6.int a;
	/*int a;
	cin >> a;
	for (int i = 10; i <= 99; i = a + 1) {
		if (i % 4 != 1 && i % 6 == 0) {
			cout << i << endl;
		}
	}*/
	//12. Ќайти произведение двузначных нечетных чисел кратных 13.
	/*int a;
	cin >> a;
	for (int i = 10; i <= 99; i = a + 1) {
		if (i % 2 != 1 && i % 13 == 0) {
			a = a * 1;
			cout << i << endl;
		}
	}*/
	//13. Ќайти сумму чисел от 100 до 200 кратных 17.

}